<!--Выведите в консоль все целые числа от 1 до 100. -->

<?php
$i = 1;
while ($i <= 100) {
    echo $i;
    $i++;
}
?>

<!--Выведите в консоль все целые числа от -100 до 0. -->

<?php
$i = -100;
while ($i <= 0) {
    echo $i;
    $i++;
}
?>

<!--Выведите в консоль все целые числа от 100 до 1. -->

<?php
$i = 100;
while ($i >= 1) {
    echo $i;
    $i--;
}
?>

<!--Выведите в консоль все четные числа из промежутка от 1 до 100. -->

<?php
$i = 0;
while ($i <= 100) {
    echo $i;
    $i += 2;
}
?>

<!--Выведите в консоль все числа кратные трем в промежутке от 1 до 100. -->

<?php
$i = 0;
while ($i <= 100) {
    echo $i;
    $i += 3;
}
?>
